# Pandas Tutorial

In [1]:
import pandas as pd
import numpy as np

# Data Structures

To get started with pandas, you will need to get comfortable with its two workhorse data structures:
- **Series**: one-dimensional array-like object containing any array of data and an associated array of data labels (index)
- **DataFrames**: tabular, spreadsheet-like data structure containing an ordered collection of columns, each of which can be a different value type (numeric, string, boolean, etc.)

## Series

In [3]:
# simplest Series is formed from an array of data
obj = pd.Series([4,7,-5,3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

A Series object has two important attributes: values (data) and index (indexs)

In [4]:
obj.values

array([ 4,  7, -5,  3])

In [5]:
obj.index

RangeIndex(start=0, stop=4, step=1)

Often it will be desirable to create a Series with an index identifying each data point:

In [6]:
obj2 = pd.Series([4, 7, -5, 3], index = ['d', 'b', 'a', 'c'])
obj2

d    4
b    7
a   -5
c    3
dtype: int64

You can get one specific value or several values by indexing with one index or a list of indexs:

In [7]:
obj2['a']

-5

In [8]:
obj2[['c', 'a', 'd']]

c    3
a   -5
d    4
dtype: int64

NumPy array operations, such as filtering with a boolean array, scalar multiplication,
or applying math functions, will preserve the index-value link:

In [9]:
obj2[obj2 > 0]

d    4
b    7
c    3
dtype: int64

In [10]:
obj2 * 2

d     8
b    14
a   -10
c     6
dtype: int64

In [11]:
np.exp(obj2)

d      54.598150
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

Another way to think about a Series is as a fixed-length, ordered dict, as it is a mapping
of index values to data values. It can be substituted into many functions that expect a
dict:

In [12]:
'b' in obj2

True

In [13]:
'e' in obj2

False

Should you have data contained in a Python dict, you can create a Series from it by
passing the dict:

In [14]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

In [15]:
obj3 = pd.Series(sdata)
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

If you want to get a Series from a dictionary but only selecting some specified keys, you can do it by passing as input a list of the keys (that will become indexes):

In [16]:
states = ['California', 'Ohio', 'Oregon', 'Texas']

In [17]:
obj4 = pd.Series(sdata, index=states)

In [18]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

Since 'California' was not in the dictionaries keys, it appears **NaN** (not a number), which **is considered in pandas to mark missing or NA (not available) values.**

Functions *isnull* and *notnull* are used to detect missing data in Python. They return a pandas Series with the same indexs and values True or False.

In [19]:
pd.isnull(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [20]:
pd.notnull(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

Series also has these as instance methods

In [21]:
obj4.isnull()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [22]:
obj4.notnull()

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

A critical Series feature for many applications is that it automatically aligns differently-indexed data in arithmetic operations:

In [23]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [24]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [25]:
obj3 + obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

Both the Series object itself and its index have a name attribute:

In [26]:
obj4.name = 'population'

In [27]:
obj4.index.name = 'state'

In [28]:
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

A Series index can be altered in place by assignment (the name of the index is lost):

In [29]:
obj4.index = ['city1', 'city2', 'city3', 'city4']

In [30]:
obj4.index.name = 'city'

In [31]:
obj4

city
city1        NaN
city2    35000.0
city3    16000.0
city4    71000.0
Name: population, dtype: float64

## DataFrame

The DataFrame has both a row and column index; it can be thought of as a dict of Series (one for all sharing the same index). There are several ways to create a DataFrame:

- Construct a DataFrame by passing as input a dict of equal-length lists or Numpy arrays:

In [32]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'],
'year': [2000, 2001, 2002, 2001, 2002],
'pop': [1.5, 1.7, 3.6, 2.4, 2.9]}

In [33]:
df = pd.DataFrame(data)

In [34]:
df

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

You can also choose the order of the columns:

In [35]:
df2 = pd.DataFrame(data, columns=['year', 'pop', 'state'])

In [36]:
df2

   year  pop   state
0  2000  1.5    Ohio
1  2001  1.7    Ohio
2  2002  3.6    Ohio
3  2001  2.4  Nevada
4  2002  2.9  Nevada

You can also pass the indexs names. And if you pass a column that isn't contained in data, it will appear with NA values:

In [37]:
df3 = pd.DataFrame(data, columns=['year', 'pop', 'state', 'debt'], index=['one', 'two', 'three', 'four', 'five'])

In [38]:
df3

       year  pop   state debt
one    2000  1.5    Ohio  NaN
two    2001  1.7    Ohio  NaN
three  2002  3.6    Ohio  NaN
four   2001  2.4  Nevada  NaN
five   2002  2.9  Nevada  NaN

You can also access the columns and indexs:

In [39]:
df3.columns

Index(['year', 'pop', 'state', 'debt'], dtype='object')

In [40]:
df3.index

Index(['one', 'two', 'three', 'four', 'five'], dtype='object')

A column in a DataFrame can be retrieved as a Series either by dict-like notation or by attribute (**the retrieved Series is a view of the column, not a copy**)

In [41]:
df3['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
Name: state, dtype: object

In [42]:
df3.state

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
Name: state, dtype: object

Rows can also be retrieved by name with .loc and by position with .iloc :

In [43]:
df3.loc['three']

year     2002
pop       3.6
state    Ohio
debt      NaN
Name: three, dtype: object

In [44]:
df3.iloc[2]

year     2002
pop       3.6
state    Ohio
debt      NaN
Name: three, dtype: object

Columns can be modified by assignment of a list or numpy array of the same length, or a scalar that will be propagated:

In [45]:
df3['debt'] = np.arange(5.)

In [46]:
df3

       year  pop   state  debt
one    2000  1.5    Ohio   0.0
two    2001  1.7    Ohio   1.0
three  2002  3.6    Ohio   2.0
four   2001  2.4  Nevada   3.0
five   2002  2.9  Nevada   4.0

In [47]:
df3['debt'] =  16

In [48]:
df3

       year  pop   state  debt
one    2000  1.5    Ohio    16
two    2001  1.7    Ohio    16
three  2002  3.6    Ohio    16
four   2001  2.4  Nevada    16
five   2002  2.9  Nevada    16

Columns can also be modified assigning a Series. In that case, it is not necessary for the Series to be of the same length. Missing indexs will be filled with NAN.

In [49]:
val = pd.Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])
df3['debt'] = val

In [50]:
df3

       year  pop   state  debt
one    2000  1.5    Ohio   NaN
two    2001  1.7    Ohio  -1.2
three  2002  3.6    Ohio   NaN
four   2001  2.4  Nevada  -1.5
five   2002  2.9  Nevada  -1.7

Assigning a column that doesn't exist will create a new column.

In [51]:
df3['eastern'] = df3.state == 'Ohio'

In [52]:
df3

       year  pop   state  debt  eastern
one    2000  1.5    Ohio   NaN     True
two    2001  1.7    Ohio  -1.2     True
three  2002  3.6    Ohio   NaN     True
four   2001  2.4  Nevada  -1.5    False
five   2002  2.9  Nevada  -1.7    False

You can delete columns using del:

In [53]:
del df3['eastern']

In [54]:
df3

       year  pop   state  debt
one    2000  1.5    Ohio   NaN
two    2001  1.7    Ohio  -1.2
three  2002  3.6    Ohio   NaN
four   2001  2.4  Nevada  -1.5
five   2002  2.9  Nevada  -1.7

- Construct a DataFrame from a nested dict of dicts. In that case, the keys in the inner dicts are unioned and sorted to form the index in the result.

In [55]:
pop = {'Nevada': {2001:2.4, 2002:2.9},
      'Ohio': {2000:1.5, 2001:1.7, 2002:3.6}}

In [56]:
df4 = pd.DataFrame(pop)

In [57]:
df4

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

DataFrames can also be transposed, that is interchanging columns and rows:

In [58]:
df4.T

        2001  2002  2000
Nevada   2.4   2.9   NaN
Ohio     1.7   3.6   1.5

- Construct a DataFrame from a dictionary of Series:

In [59]:
pdata = {'Ohio': df4['Ohio'][:-1],
        'Nevada': df4['Nevada'][:-1]}

In [60]:
df5 = pd.DataFrame(pdata)

In [61]:
df5

      Ohio  Nevada
2001   1.7     2.4
2002   3.6     2.9

Like Series, the values attribute returns the data contained in the DataFrame as a 2D numpy.ndarray:

In [62]:
df4.values

array([[2.4, 1.7],
       [2.9, 3.6],
       [nan, 1.5]])

In [63]:
df4.values.dtype

dtype('float64')

If the DataFrame's columnsa re different dtypes, the dtypes of the values array will be chosen accordingly:

In [64]:
df3.values

array([[2000, 1.5, 'Ohio', nan],
       [2001, 1.7, 'Ohio', -1.2],
       [2002, 3.6, 'Ohio', nan],
       [2001, 2.4, 'Nevada', -1.5],
       [2002, 2.9, 'Nevada', -1.7]], dtype=object)

In [65]:
df3.values.dtype # object type

dtype('O')

## Index Objects

Any array or other sequence of labels used when constructing a Series or DataFrame is internally converted to an Index:

In [66]:
obj = pd.Series(np.arange(3), index=['a','b','c'])

In [67]:
index = obj.index

In [68]:
index

Index(['a', 'b', 'c'], dtype='object')

In [69]:
index[:-1]

Index(['a', 'b'], dtype='object')

Index objects are **immutable** and thus can't be modified:

In [70]:
index[1] = 'd'

TypeError: Index does not support mutable operations

Immutability is important so that Index objects can be safely shared among data
structures:

In [ ]:
index = pd.Index(np.arange(3))

In [ ]:
obj2 = pd.Series([1.5, -2.5, 0], index=index)

In [ ]:
index is obj2.index

In addition to being array-like, an Index also functions as a fixed-size set:

In [ ]:
df4

In [ ]:
'Ohio' in df4.columns

In [ ]:
2001 in df4.index

Index methods and properties:

In [ ]:
index1 = pd.Index(np.arange(10))
index2 = pd.Index(np.arange(20))

- pd.Index.append(idx1, idx2): appends both indexes in the given order

In [ ]:
pd.Index.append(index2, index1)

- pd.Index.difference(idx1, idx2): returns index object with elements in idx1 not in idx2 (order matters)

In [ ]:
# Index with elements in index1 not in index2
pd.Index.difference(index1, index2)

In [ ]:
# Index with elements in index2 not in index1
pd.Index.difference(index2, index1)

- pd.Index.intersection(idx1, idx2): computes set intersection:

In [ ]:
pd.Index.intersection(index1, index2)

- pd.Index.union(idx1, idx2): computes set union:

In [ ]:
pd.Index.union(index1, index2)

- idx1.isin(index2): returns a boolean array indicating whether each value of idx1 is in idx2 or not:

In [ ]:
index1.isin(index2)

In [ ]:
index2.isin(index1)

- idx.delete(i): returns new index with element at index i (i being the position, not the value) deleted

In [ ]:
index1 = index1.delete(5)
index1

- idx.delete([i,j,..k]): returns new index with elements at index i, j, .., k deleted:

In [ ]:
index2 = index2.delete([14,15,16])
index2

- idx.insert(loc, item): returns new index with inserted index item at location loc

In [ ]:
index2 = index2.insert(14, 1000)
index2

- idx.is_monotonic: returns True if each elemnet is greater or equal than previous elements:

In [ ]:
index2.is_monotonic

In [ ]:
index1.is_monotonic

- idx.is_unique: returns True if the Index has no duplicate values

In [ ]:
index2.is_unique

In [ ]:
index2 = index2.insert(1, 1)

In [ ]:
index2

- idx.unique(): returns an array of unique values in the Index

In [ ]:
index2.unique()

- idx.drop([val1, val2]): drops values in value list (only works if all indices are **unique**)

In [ ]:
index1.drop([2,4])

In [ ]:
index2.drop([1])

In [ ]:
index3 = pd.Index(['John', 'Mike', 'Maria'])

In [ ]:
index3.drop(['John'])

# Essential Functionality

In this section, Ill walk you through the fundamental mechanics of interacting with
the data contained in a Series or DataFrame

## Reindexing

**Reindexing requires indexs**

Calling reindex on this **Series** rearranges the data according to the new index, intro-
ducing missing values if any index values were not already present:

In [ ]:
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])

In [ ]:
obj

If we introduce a new index, it will apear with NAN values:

In [ ]:
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])

In [ ]:
obj2

Unless we specify fill_value:

In [ ]:
obj.reindex(['a', 'b', 'c', 'd', 'e'], fill_value=0)

For ordered data like time series, it may be desirable to do some interpolation or filling
of values when reindexing. We can specify that putting method equal to 'ffill' to fill forwards and 'bfill' to fill backwards:

In [ ]:
obj3 = pd.Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])

In [ ]:
obj3

In [ ]:
obj3.reindex(range(6), method='ffill')

In [ ]:
obj3.reindex(range(6), method='bfill')

With **DataFrame**, reindex can alter either the (row) index, columns, or both.

In [ ]:
df = pd.DataFrame(np.arange(9).reshape((3,3)), index = ['a', 'c', 'd'], columns=['Ohio', 'Texas', 'California'])

In [ ]:
df

If only a sequence is passed, reindex will affect the indices:

In [ ]:
df2 = df.reindex(['a', 'b', 'c', 'd'])

In [ ]:
df2

Columns can be reindexed using the columns keyword:

In [ ]:
df.reindex(columns=['Texas', 'Utah', 'California'])

Both can be reindexed using *index* and *columns* keywords. If a *method* is specified, it will propagate in rows:

In [ ]:
df.reindex(index=['a','b','c','d'], columns=['Texas', 'Utah', 'California'])

The method ffill is best used as df.ffill() because it requires indices to be monotically ordered.

In [ ]:
df.reindex(index=['a','b','c','d'], columns=['Texas', 'Utah', 'California']).ffill()

## Dropping entries from axis

*drop* method will return a new object with the indicated value or values deleted from an axis

### With **Series**:

In [ ]:
obj = pd.Series(np.arange(5.), index=['a', 'b', 'c', 'd', 'e'])

In [ ]:
obj.drop('c')

### With **DataFrames**:

In [ ]:
df = pd.DataFrame(np.arange(16).reshape((4, 4)),
index=['Ohio', 'Colorado', 'Utah', 'New York'],
columns=['one', 'two', 'three', 'four'])

In [ ]:
df

Dropping rows by index value:

In [ ]:
data.drop(['Colorado', 'Ohio'])

Dropping columns:

In [ ]:
data.drop(['two'], axis=1) # axis=1 refers to column

In [ ]:
data.drop(['Ohio'], axis=0) # axis=0 refers to row

## Indexing, selection and filtering

### Series

Series indexing ( obj[...] ) works analogously to NumPy array indexing, except you can
use the Seriess index values or integers:

In [ ]:
obj = pd.Series(np.arange(4.), index=['a', 'b', 'c', 'd'])

In [ ]:
obj

In [ ]:
# indexing using [value]
obj[['b']] # returns a Series

In [ ]:
# indexing using value
obj['b'] # returns a scalar

In [ ]:
# indexing using integer
obj[1]

In [ ]:
obj[['b','c']]

In [ ]:
obj[[1,2]]

Slicing with indices (not values) works the same way as NumPy arrays:

In [ ]:
obj[obj < 2]

In [ ]:
obj[1:3]

Slicing with labels (values) behaves differently because **the end point is inclusive**:

In [ ]:
obj['b':'c']

### DataFrame

In [ ]:
df = pd.DataFrame(np.arange(16).reshape((4, 4)),
index=['Ohio', 'Colorado', 'Utah', 'New York'],
columns=['one', 'two', 'three', 'four'])

In [ ]:
df

Columns can be retrieved by passing a single value or sequence:

In [ ]:
df['one']

In [ ]:
df[['one', 'three']]

Rows can be retrieved with integer slicing (always a DataFrame is retrieved, which is a **view** of the original DataFrame):

In [ ]:
df[:2]

Rows cannot be retrieved with a single integer number:

In [ ]:
df[0]

Slicing rows works like NumPy arrays:

In [ ]:
df[df['three'] > 5]

You can also index with a boolean DataFrame, like in NumPy arrays:

In [ ]:
df < 5

In [ ]:
df[df < 5] = 0

In [ ]:
df

### .loc

Indexing rows with labels requires a different syntax (otherwise it would be confused with column labels).

**.loc** is used to access positions with labels in the same way as Numpy Array (first dimension is rows, second is columns).
- If you use fancy indexing, the returned Series or DataFrame is a **copy**

In [ ]:
df = pd.DataFrame(np.arange(16).reshape((4, 4)),
index=['Ohio', 'Colorado', 'Utah', 'New York'],
columns=['one', 'two', 'three', 'four'])

In [ ]:
df

In [ ]:
df2 = df.loc['Ohio', ['two', 'three']]

In [ ]:
df2

In [ ]:
df2[:] = 999

In [ ]:
df2

In [ ]:
df # df is not affected by changes in df2

Contrary to ndarrays, fancy indexing works normally: ['Ohio', 'Colorado'], ['two', 'three'] retrievs rows 'Ohio', 'Colorado' and columns 'two', 'three' instead of position 3,2 and 1,3.

In [ ]:
df.loc[['Ohio', 'Colorado'], ['two', 'three']]


- If you use slicing, the returned Series or DataFrame is a **view**

In [ ]:
df3 = df.loc['Ohio', 'two':'three']

In [ ]:
df3[:] = 999

In [ ]:
df # df is affected by changes in df3

###  .iloc

**.iloc** works like .loc but you can access rows and columns with integer values. In this case, slices works normally (i:j - j is not included).

In [ ]:
df = pd.DataFrame(np.arange(16).reshape((4, 4)),
index=['Ohio', 'Colorado', 'Utah', 'New York'],
columns=['one', 'two', 'three', 'four'])

In [ ]:
df

In [ ]:
df.iloc[3, 2]

In [ ]:
df.iloc[3, :2]

Contrary to ndarrays, fancy indexing works normally: [3,1], [2,3] retrievs rows 3, 1 and columns 2, 3 instead of position 3,2 and 1,3.

In [ ]:
df.iloc[[3, 1], [2, 3]]

## Arithmetic and data alignment

One of the most important pandas features is the behavior of arithmetic between ob-
jects with different indexes. When adding together objects, if any index pairs are not
the same, the respective index in the result will be the union of the index pairs.

### Basic arithmetic

In [ ]:
s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index=['a', 'c', 'd', 'e'])

In [ ]:
s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1], index=['a', 'c', 'e', 'f', 'g'])

In [ ]:
s1

In [ ]:
s2

Adding two Series produced NAN values for indices not in the intersection:

In [ ]:
s1 + s2

In the case of DataFrames, alignment is performed both on rows and columns:

In [ ]:
df1 = pd.DataFrame(np.arange(9.).reshape((3, 3)), columns=list('bcd'),
index=['Ohio', 'Texas', 'Colorado'])

In [ ]:
df2 = pd.DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'),
index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [ ]:
df1

In [ ]:
df2

Adding two DataFrames:

In [ ]:
df1 + df2

### Arithmetic with fill values

Let's talk about the method *df1.add(df2, fill_value=0)*. When a value is present in one df and not the other one, it replaces the missing value with 0 for the sum. If the value is not present in any df, the result is NAN.

In [ ]:
df1

In [ ]:
df2

In [ ]:
# Addition
df1.add(df2, fill_value=0)

Here the item in row 'Colorado' and column 'e' has a NaN value because it is not present in either dataset.

In [ ]:
# Substraction
df1.sub(df2, fill_value=0)

In [ ]:
# Division
df1.div(df2, fill_value=1)

In [ ]:
# Multiplication
df1.mul(df2, fill_value=1)

### Operations between DataFrame and Series

In [ ]:
df = pd.DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'),
index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [ ]:
df

In [ ]:
series = df.iloc[0]

In [ ]:
series

By default, arithmetic between DataFrame and Series matches the index of the Series
on the DataFrame's columns, broadcasting down the rows:

In [ ]:
df - series

If an index value is not found in either the DataFrames columns or the Seriess index,
the objects will be reindexed to form the union:

In [ ]:
series2 = pd.Series(range(3), index=list('bef'))

In [ ]:
series2

In [ ]:
df - series2

If you want to broadcast over the columns, you have to use an arithmetic method (.add, .sum, .mul, .div) and set axis=0. **The axis number that you pass is the axis to match on.**

In [ ]:
series3 = df['d']

In [ ]:
series3

In [ ]:
df.sub(series3, axis=0)

## Function application and mapping

- NumPy ufuncs (element-wise array methods) work fine with pandas objects:

In [72]:
df = pd.DataFrame(np.random.randn(4,3), columns = list('bde'), index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [73]:
df

               b         d         e
Utah    0.340234 -0.985494 -0.209564
Ohio    0.135608 -0.050655  0.315659
Texas  -0.901680  0.333909  1.845551
Oregon -1.028797  1.074896 -0.697058

In [75]:
np.abs(df)

               b         d         e
Utah    0.340234  0.985494  0.209564
Ohio    0.135608  0.050655  0.315659
Texas   0.901680  0.333909  1.845551
Oregon  1.028797  1.074896  0.697058

In [76]:
np.exp(df)

               b         d         e
Utah    1.405277  0.373255  0.810938
Ohio    1.145233  0.950607  1.371163
Texas   0.405887  1.396416  6.331588
Oregon  0.357437  2.929689  0.498048

- To apply other custom-made element-wise functions you have to use the DataFrame 's method *.applymap*:

In [84]:
op = lambda x: 3*x - 2

In [85]:
df.applymap(op)

               b         d         e
Utah   -0.979297 -4.956482 -2.628691
Ohio   -1.593177 -2.151965 -1.053022
Texas  -4.705040 -0.998274  3.536653
Oregon -5.086391  1.224689 -4.091174

- In fact, Series has a method *.map* that applies element-wise functions:

In [86]:
series = df['b']

In [87]:
series

Utah      0.340234
Ohio      0.135608
Texas    -0.901680
Oregon   -1.028797
Name: b, dtype: float64

In [88]:
series.map(op)

Utah     -0.979297
Ohio     -1.593177
Texas    -4.705040
Oregon   -5.086391
Name: b, dtype: float64

- You can also apply a function on 1D arrays to each column or row with the method *df.apply(f, axis=0)*

    - If the function returns a Scalar, you will obtain a Series where the values will be the result of the applied function on each row or column:

In [77]:
f1 = lambda x: x.max() - x.min()

In [81]:
df.apply(f1, axis=0)

b    1.369031
d    2.060390
e    2.542609
dtype: float64

In [82]:
df.apply(f1, axis=1)

Utah      1.325729
Ohio      0.366314
Texas     2.747231
Oregon    2.103693
dtype: float64

     - If the function returns a Series, you will obtain a DataFrame where rows or columns will be the Series that result from the function:

In [79]:
f2 = lambda x: pd.Series([x.min(), x.max()], index = ['min', 'max'])

In [80]:
df.apply(f2)

            b         d         e
min -1.028797 -0.985494 -0.697058
max  0.340234  1.074896  1.845551

## Sorting and ranking

### .sort_index()

To sort lexicographically by row or column index, use the sort_index method, which returns a new, sorted object:

- For Series:

In [90]:
s = pd.Series(range(4), index=list('dabc'))

In [91]:
s

d    0
a    1
b    2
c    3
dtype: int64

In [92]:
s.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

- For DataFrames, you can choose to sort by index or column label with axis=0 or axis=1:

In [93]:
df = pd.DataFrame(np.arange(8).reshape((2,4)), index=['three', 'one'], columns=list('dabc'))

In [94]:
df

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [95]:
df.sort_index(axis=0)

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [96]:
df.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

- You can also choose to sort in descending order with ascending=False:

In [97]:
df.sort_index(axis=1, ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

### .sort_values()

- To sort a Series by its values, use its method *.sort_values()*:

In [101]:
s = pd.Series([4,7,-3,2])

In [99]:
s

0    4
1    7
2   -3
3    2
dtype: int64

In [102]:
s.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

In [103]:
s.sort_values(ascending=False)

1    7
0    4
3    2
2   -3
dtype: int64

- To sort a DataFrame by value, you must specify the parameter *by*, which can be a string or list of strings that correspond to index or column labels that you want to sort by. You can also indicate index or column levels if you specify axis= 0, 1. If axis=0 then the rows will be sorted, otherwise the columns will be sorted. The default is axis=0 so you must specify otherwise.

In [114]:
df = pd.DataFrame({'b': [4, 7, -3, 2], 'a': [0, 1, 0, 1]}, index=['John', 'Mary', 'Bonnie', 'Clyde'])

In [115]:
df

        b  a
John    4  0
Mary    7  1
Bonnie -3  0
Clyde   2  1

In [116]:
df.sort_values(by='b')

        b  a
Bonnie -3  0
Clyde   2  1
John    4  0
Mary    7  1

In [121]:
df.sort_values(by='a')

        b  a
John    4  0
Bonnie -3  0
Mary    7  1
Clyde   2  1

In [125]:
df.sort_values(by=['a', 'b'])

        b  a
Bonnie -3  0
John    4  0
Clyde   2  1
Mary    7  1

In [123]:
df.sort_values(by='John', axis=1)

        a  b
John    0  4
Mary    1  7
Bonnie  0 -3
Clyde   1  2

### .rank()

.rank() method assigns ranks from one through the number of
valid data points in an array.

In [127]:
s = pd.Series([7, -5, 4, 2], index=['Coke', 'Fanta', 'Pepsi', 'NesTea'])

In [128]:
s

Coke      7
Fanta    -5
Pepsi     4
NesTea    2
dtype: int64

In [129]:
s.rank()

Coke      4.0
Fanta     1.0
Pepsi     3.0
NesTea    2.0
dtype: float64

If two indexs have the same value, then the rank assigned is the average of their ranks:

In [130]:
s = pd.Series([7, -5, 4, 2, 4], index=['Coke', 'Fanta', 'Pepsi', 'NesTea', 'Sprite'])

In [131]:
s

Coke      7
Fanta    -5
Pepsi     4
NesTea    2
Sprite    4
dtype: int64

You see that here Sprite and Fanta share the 3rd and 4th position, so they are both assigned 3.5

In [132]:
s.rank()

Coke      5.0
Fanta     1.0
Pepsi     3.5
NesTea    2.0
Sprite    3.5
dtype: float64

You can also select the *tie-breaking method* to use when there is a tie:

- method='average': default
- method='min': use the minimum rank for the whole group
- method='max': use the maximum rank for the whole group
- method='first': assign ranks in the order values appear in the data

For DataFrames, you can specify the axis on which you want to compute ranks:

In [135]:
df = pd.DataFrame({'b': [4.3, 7, -3, 2], 'a': [0, 1, 0, 1],
'c': [-2, 5, 8, -2.5]})

In [136]:
df

     b  a    c
0  4.3  0 -2.0
1  7.0  1  5.0
2 -3.0  0  8.0
3  2.0  1 -2.5

In [139]:
df.rank(axis=0) # assigns rank over rows

     b    a    c
0  3.0  1.5  2.0
1  4.0  3.5  3.0
2  1.0  1.5  4.0
3  2.0  3.5  1.0

In [138]:
df.rank(axis=1) # assigns rank over columns

     b    a    c
0  3.0  2.0  1.0
1  3.0  1.0  2.0
2  1.0  2.0  3.0
3  3.0  2.0  1.0

## Axis indexes with duplicate values

- Series: when there are duplicate index values, calling the given index returns a Series instead of a scalar

In [141]:
obj = pd.Series(range(5), index=['a', 'a', 'b', 'b', 'c'])

In [142]:
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [143]:
obj['a']

a    0
a    1
dtype: int64

In [144]:
obj['c']

4

- DataFrame: when there are duplicate index values, calling the given index returns a DataFrame instead of a Series

In [145]:
df = pd.DataFrame(np.random.randn(4,3), index=list('aabb'))

In [146]:
df.loc['a']

          0         1         2
a  0.507239  0.007897  0.105958
a  1.281582  1.773360  0.825245

## Summarizing and Computing Descriptive Statistics

There are methods for DataFrames called *reductions* or *summary statistics* that extract a single value from a Series or a Series from the a DataFrame:

In [5]:
df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5],
[np.nan, np.nan], [0.75, -1.3]],
index=['a', 'b', 'c', 'd'],
columns=['one', 'two'])

In [6]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

All of the *reduction methods* have three options:

- axis: axis to reduce over (0 for rows 1 for columns)
- skipna: exclude missing values (default True)
- level: reduce grouped by level if axis is hierarchically-indexed

Some reduction methods are:

- sum:

In [7]:
df.sum()

one    9.25
two   -5.80
dtype: float64

- mean:

In [9]:
df.mean(axis=1)

a    1.400
b    1.300
c      NaN
d   -0.275
dtype: float64

- idxmin, idxmax return index value where minimum or maximum values are attained:

In [10]:
df.idxmax()

one    b
two    d
dtype: object

In [11]:
df.idxmin(axis=1)

a    one
b    two
c    NaN
d    two
dtype: object

- cumsum: accumulation

In [13]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [12]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

- describe: produces multiple summary statistics:

In [14]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

For non-numeric dataframes, describe produces adequate describing statistics:

In [15]:
obj = pd.Series(list('aabc')*4)

In [16]:
obj

0     a
1     a
2     b
3     c
4     a
5     a
6     b
7     c
8     a
9     a
10    b
11    c
12    a
13    a
14    b
15    c
dtype: object

In [17]:
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

## Correlation and Covariance

Lets consider some DataFrames of stock prices and volumes obtained from
Yahoo! Finance:

In [4]:
import pandas_datareader

ModuleNotFoundError: No module named 'pandas_datareader'

In [4]:
import pandas_datareader.data as web

data = {}
for company in ['AAPL', 'IBM', 'MSFT', 'GOOG']:
    data[company] = web.get_data_yahoo(company, '1/1/2000', '1/1/2010')

In [5]:
data

{'AAPL':                 High       Low      Open     Close       Volume  Adj Close
 Date
 2000-01-03  1.004464  0.907924  0.936384  0.999442  535796800.0   0.855168
 2000-01-04  0.987723  0.903460  0.966518  0.915179  512377600.0   0.783068
 2000-01-05  0.987165  0.919643  0.926339  0.928571  778321600.0   0.794528
 2000-01-06  0.955357  0.848214  0.947545  0.848214  767972800.0   0.725771
 2000-01-07  0.901786  0.852679  0.861607  0.888393  460734400.0   0.760149
 ...              ...       ...       ...       ...          ...        ...
 2009-12-24  7.476786  7.262500  7.269643  7.465714  500889200.0   6.388003
 2009-12-28  7.641071  7.486072  7.561429  7.557500  644565600.0   6.466540
 2009-12-29  7.597143  7.454643  7.593928  7.467857  445205600.0   6.389839
 2009-12-30  7.571429  7.439643  7.458214  7.558571  412084400.0   6.467456
 2009-12-31  7.619643  7.520000  7.611786  7.526072  352410800.0   6.439648

 [2515 rows x 6 columns],
 'IBM':                   High         Low        Open       Close      Volume  \
 Date
 2000-01-03  116.000000  111.875000  112.437500  116.000000  10347700.0
 2000-01-04  114.500000  110.875000  114.000000  112.062500   8227800.0
 2000-01-05  119.750000  112.125000  112.937500  116.000000  12733200.0
 2000-01-06  118.937500  113.500000  118.000000  114.000000   7971900.0
 2000-01-07  117.937500  110.625000  117.250000  113.500000  11856700.0
 ...                ...         ...         ...         ...         ...
 2009-12-24  130.570007  129.479996  129.889999  130.570007   4265100.0
 2009-12-28  132.309998  130.720001  130.990005  132.309998   5800400.0
 2009-12-29  132.369995  131.800003  132.279999  131.850006   4184200.0
 2009-12-30  132.679993  130.679993  131.229996  132.570007   3867000.0
 2009-12-31  132.850006  130.750000  132.410004  130.899994   4223400.0

             Adj Close
 Date
 2000-01-03  72.603600
 2000-01-04  70.139145
 2000-01-05  72.603600
 2000-01-06  71.351852
 2000-01-07  71.038895
 ...               ...
 2009-12-24  90.855721
 2009-12-28  92.066490
 2009-12-29  91.746384
 2009-12-30  92.247391
 2009-12-31  91.085335

 [2515 rows x 6 columns],
 'MSFT':                  High        Low       Open      Close      Volume  Adj Close
 Date
 2000-01-03  59.312500  56.000000  58.687500  58.281250  53228400.0  37.102634
 2000-01-04  58.562500  56.125000  56.781250  56.312500  54119000.0  35.849308
 2000-01-05  58.187500  54.687500  55.562500  56.906250  64059600.0  36.227283
 2000-01-06  56.937500  54.187500  56.093750  55.000000  54976600.0  35.013741
 2000-01-07  56.125000  53.656250  54.312500  55.718750  62013600.0  35.471302
 ...               ...        ...        ...        ...         ...        ...
 2009-12-24  31.000000  30.760000  30.879999  31.000000  11083900.0  24.144302
 2009-12-28  31.180000  30.889999  31.000000  31.170000  25384000.0  24.276709
 2009-12-29  31.500000  31.230000  31.350000  31.389999  29716200.0  24.448051
 2009-12-30  31.290001  30.799999  31.150000  30.959999  42006200.0  24.113148
 2009-12-31  30.990000  30.480000  30.980000  30.480000  31929700.0  23.739305

 [2515 rows x 6 columns],
 'GOOG':                   High         Low        Open       Close    Volume  \
 Date
 2004-08-19   51.835709   47.800831   49.813286   49.982655  44871300
 2004-08-20   54.336334   50.062355   50.316402   53.952770  22942800
 2004-08-23   56.528118   54.321388   55.168217   54.495735  18342800
 2004-08-24   55.591629   51.591621   55.412300   52.239193  15319700
 2004-08-25   53.798351   51.746044   52.284027   52.802086   9232100
 ...                ...         ...         ...         ...       ...
 2009-12-24  308.603271  304.991821  305.320587  308.085236   1723800
 2009-12-28  311.826202  308.085236  309.669281  310.272034   3408400
 2009-12-29  311.253357  307.990570  311.203522  308.543518   2860200
 2009-12-30  310.202271  307.851105  308.095184  310.202271   2942100
 2009-12-31  311.532288  308.832428  311.208527  308.832428   2448700

              Adj Close
 Date
 2004-08-19   49.982655
 2004-08-20   53.952770
 2004-08-23   54.495735
 2004-08-24   52.239193
 2004-08-25   52.802086
 ...                ...
 2009-12-24  308.085236
 2009-12-28  310.272034
 2009-12-29  308.543518
 2009-12-30  310.202271
 2009-12-31  308.832428

 [1353 rows x 6 columns]}

In [6]:
data['IBM']

,High,Low,Open,Close,Volume,Adj Close
Date,,,,,,
2000-01-03,116.000000,111.875000,112.437500,116.000000,10347700.0,72.603600
2000-01-04,114.500000,110.875000,114.000000,112.062500,8227800.0,70.139145
2000-01-05,119.750000,112.125000,112.937500,116.000000,12733200.0,72.603600
2000-01-06,118.937500,113.500000,118.000000,114.000000,7971900.0,71.351852
2000-01-07,117.937500,110.625000,117.250000,113.500000,11856700.0,71.038895
...,...,...,...,...,...,...
2009-12-24,130.570007,129.479996,129.889999,130.570007,4265100.0,90.855721
2009-12-28,132.309998,130.720001,130.990005,132.309998,5800400.0,92.066490
2009-12-29,132.369995,131.800003,132.279999,131.850006,4184200.0,91.746384
2009-12-30,132.679993,130.679993,131.229996,132.570007,3867000.0,92.247391
2009-12-31,132.850006,130.750000,132.410004,130.899994,4223400.0,91.085335

Construct a price dataset with company's names as columns and close prices for each date as rows (and the same for the volume variable):

In [10]:
price_data = {company:data[company]['Close'] for company in data.keys()}
volume_data = {company:data[company]['Volume'] for company in data.keys()}

In [11]:
price = pd.DataFrame(price_data)
volume = pd.DataFrame(volume_data)

In [17]:
price.tail()

                AAPL         IBM       MSFT        GOOG
Date
2009-12-24  7.465714  130.570007  31.000000  308.085236
2009-12-28  7.557500  132.309998  31.170000  310.272034
2009-12-29  7.467857  131.850006  31.389999  308.543518
2009-12-30  7.558571  132.570007  30.959999  310.202271
2009-12-31  7.526072  130.899994  30.480000  308.832428

- pct.change(): percentage change between the current and a prior element

In [15]:
returns = price.pct_change()

In [16]:
returns.tail()

                AAPL       IBM      MSFT      GOOG
Date
2009-12-24  0.034339  0.004385  0.002587  0.011117
2009-12-28  0.012294  0.013326  0.005484  0.007098
2009-12-29 -0.011861 -0.003477  0.007058 -0.005571
2009-12-30  0.012147  0.005461 -0.013699  0.005376
2009-12-31 -0.004300 -0.012597 -0.015504 -0.004416

- .corr(), .cov(): returns correlation and covariance matrices of all the columns with all the columns:

In [18]:
returns.corr()

          AAPL       IBM      MSFT      GOOG
AAPL  1.000000  0.410411  0.423174  0.470676
IBM   0.410411  1.000000  0.493821  0.390354
MSFT  0.423174  0.493821  1.000000  0.438685
GOOG  0.470676  0.390354  0.438685  1.000000

In [19]:
returns.cov()

          AAPL       IBM      MSFT      GOOG
AAPL  0.001027  0.000252  0.000309  0.000303
IBM   0.000252  0.000367  0.000216  0.000142
MSFT  0.000309  0.000216  0.000519  0.000204
GOOG  0.000303  0.000142  0.000204  0.000580

- df.columnA.corr(df.columnB): computes correlation between columnA and columnB

In [20]:
returns.MSFT.corr(returns.IBM)

0.49382129151035503

- df.corrwith(df.column): computes the correlation between a columnn and the rest of them:

In [21]:
returns.corrwith(returns.IBM)

AAPL    0.410411
IBM     1.000000
MSFT    0.493821
GOOG    0.390354
dtype: float64

- df1.corrwith(df2): computes the correlations between matching columns of both datasets:

In [22]:
returns.corrwith(volume)

AAPL   -0.057549
IBM    -0.007717
MSFT   -0.015785
GOOG    0.062647
dtype: float64

## Unique Values, Value Counts and Membership

- .unique(): compute array of unique values in a Series, returned in the order observed

In [23]:
obj = pd.Series(list('cadaabbcc'))

In [24]:
obj

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

In [25]:
obj.unique()

array(['c', 'a', 'd', 'b'], dtype=object)

- .isin(): Compute boolean array indicating whether each Series value is contained in the passed sequence of values.

In [26]:
mask = obj.isin(['a', 'b'])

In [27]:
mask

0    False
1     True
2    False
3     True
4     True
5     True
6     True
7    False
8    False
dtype: bool

- .value_counts(): Return a Series containing unique values as its index and frequencies as its values, ordered count in
descending order.

In [30]:
obj.value_counts()

c    3
a    3
b    2
d    1
dtype: int64

This is also available as a pandas method:

In [33]:
pd.value_counts(obj, sort=False)

d    1
a    3
c    3
b    2
dtype: int64

## Handling Missing Data

Data types np.nan and None are considered NAN in pandas. You can see if a value is NAN or not by using method *.isnull()* (both in Series and DataFrames)

In [34]:
df = pd.DataFrame({'key':list('abcd'), 'fruit':['apple', 'pear', np.nan, 'banana']})

In [35]:
df

  key   fruit
0   a   apple
1   b    pear
2   c     NaN
3   d  banana

In [36]:
df.isnull()

     key  fruit
0  False  False
1  False  False
2  False   True
3  False  False

### Filtering Out Missing Data

In [39]:
from numpy import nan as NA

In [40]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],
[NA, NA, NA], [NA, 6.5, 3.]])

In [41]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

#### .dropna()

- .dropna(): Filter axis labels based on whether values for each label have missing data.

In [42]:
data.dropna()

     0    1    2
0  1.0  6.5  3.0

- .dropna(how='all'): only drops row if all values are NAN

In [44]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

- .dropna(axis=1): drops columns instead of rows

In [48]:
data[4] = NA

In [50]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [51]:
data.dropna(how='all', axis=1)

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

- .dropna(thresh=3): only drops row if at least 3 observations are found (3 not NAN values)

In [52]:
data.dropna(thresh=3)

     0    1    2   4
0  1.0  6.5  3.0 NaN

### Filling In Missing Data: .fillna()

In [72]:
df = pd.DataFrame(np.random.randn(7,3))

In [73]:
df.iloc[:4,1] = NA

In [74]:
df.iloc[:2,2] = NA

In [75]:
df

          0         1         2
0 -0.776808       NaN       NaN
1  1.017179       NaN       NaN
2  1.063391       NaN -0.041421
3 -1.151208       NaN -0.059737
4  1.070494 -1.631395  0.150645
5 -1.057898 -1.655688  1.135153
6 -0.385998  0.068275  1.506988

- df.fillna(0): fills NAN value with 0

In [58]:
df.fillna(0)

          0         1         2
0  0.292486  0.000000  0.000000
1  0.439979  0.000000  0.000000
2 -1.360728  0.000000  1.558183
3 -0.728805  0.000000 -0.469741
4  1.377729  0.598283  0.827019
5 -1.407461 -1.365249  0.032866
6  0.935189  1.630050  1.071306

- To use a different value for each column, you can specify this with a dictionary {col_index:fill_value}

In [59]:
df.fillna({1:-3.5,2:9.7})

          0         1         2
0  0.292486 -3.500000  9.700000
1  0.439979 -3.500000  9.700000
2 -1.360728 -3.500000  1.558183
3 -0.728805 -3.500000 -0.469741
4  1.377729  0.598283  0.827019
5 -1.407461 -1.365249  0.032866
6  0.935189  1.630050  1.071306

- inplace: .fillna returns a new object. To modify the existing object, use *inplace=True*:

In [69]:
df

          0         1         2
0 -0.137869       NaN       NaN
1 -0.294902       NaN       NaN
2 -1.260433       NaN -0.782862
3 -0.159169       NaN  0.001925
4  0.461098 -0.513859 -2.067305
5 -0.107162 -1.188145 -0.140816
6  0.069562 -1.092709  2.319279

In [70]:
df.fillna(0, inplace=True)

In [71]:
df

          0         1         2
0 -0.137869  0.000000  0.000000
1 -0.294902  0.000000  0.000000
2 -1.260433  0.000000 -0.782862
3 -0.159169  0.000000  0.001925
4  0.461098 -0.513859 -2.067305
5 -0.107162 -1.188145 -0.140816
6  0.069562 -1.092709  2.319279

- method: to fill NAN by forward or backward fill

In [77]:
df = pd.DataFrame(np.random.randn(6, 3))

In [78]:
df.iloc[2:, 1] = NA
df.iloc[4:, 2] = NA

In [80]:
df

          0         1         2
0  0.180269 -0.281411 -0.554501
1  0.998763  0.188557 -0.853463
2  0.361059       NaN  1.207832
3  1.603110       NaN -0.091633
4  1.609783       NaN       NaN
5  0.602503       NaN       NaN

In [79]:
df.fillna(method='ffill')

          0         1         2
0  0.180269 -0.281411 -0.554501
1  0.998763  0.188557 -0.853463
2  0.361059  0.188557  1.207832
3  1.603110  0.188557 -0.091633
4  1.609783  0.188557 -0.091633
5  0.602503  0.188557 -0.091633

In [81]:
df.fillna(method='ffill', limit=2)

          0         1         2
0  0.180269 -0.281411 -0.554501
1  0.998763  0.188557 -0.853463
2  0.361059  0.188557  1.207832
3  1.603110  0.188557 -0.091633
4  1.609783       NaN -0.091633
5  0.602503       NaN -0.091633

## Hierarchical Indexing

Hierarchical indexing is an important feature of pandas enabling you to have multiple
(two or more) index levels on an axis

In [84]:
data = pd.Series(np.random.randn(10),
index=[['a', 'a', 'a', 'b', 'b', 'b', 'c', 'c', 'd', 'd'],
[1, 2, 3, 1, 2, 3, 1, 2, 2, 3]])

In [86]:
data

a  1    0.381650
   2   -0.121660
   3    0.180068
b  1   -0.881029
   2   -0.549192
   3   -0.598805
c  1    0.199475
   2   -0.939296
d  2    0.069097
   3   -1.995379
dtype: float64

In [87]:
data.index

MultiIndex([('a', 1),
            ('a', 2),
            ('a', 3),
            ('b', 1),
            ('b', 2),
            ('b', 3),
            ('c', 1),
            ('c', 2),
            ('d', 2),
            ('d', 3)],
           )

*Partial* indexing: if you index by the first level, you obtain a Series with simple indexes:

In [88]:
data['b']

1   -0.881029
2   -0.549192
3   -0.598805
dtype: float64

In [89]:
data['b':'c']

b  1   -0.881029
   2   -0.549192
   3   -0.598805
c  1    0.199475
   2   -0.939296
dtype: float64

In [91]:
data.loc[['b', 'd']]

b  1   -0.881029
   2   -0.549192
   3   -0.598805
d  2    0.069097
   3   -1.995379
dtype: float64

Hierarchical indexing is important for data reshaping:

- .unstack(): takes high level indices as row indices and inner indices as columns

In [93]:
data.unstack()

          1         2         3
a  0.381650 -0.121660  0.180068
b -0.881029 -0.549192 -0.598805
c  0.199475 -0.939296       NaN
d       NaN  0.069097 -1.995379

- .stack(): does the inverse; from a dataframe to a Series with hierarchical indices

In [94]:
data.unstack().stack()

a  1    0.381650
   2   -0.121660
   3    0.180068
b  1   -0.881029
   2   -0.549192
   3   -0.598805
c  1    0.199475
   2   -0.939296
d  2    0.069097
   3   -1.995379
dtype: float64